// Anm
/*
------------------------------------------------------
作者   : Black Ghost
日期   : 2018-12-6
版本   : 0.0.0
------------------------------------------------------
             m
    计算排列 A  的值
             n
------------------------------------------------------
输入   :
    n       数据点矩阵，(n+1)x2，第一列xi；第二列yi
    m       插值点, xq!=xi
输出   :
    sol     结果
    err     解出标志：false-未解出或达到步数上限；
                     true-全部解出
------------------------------------------------------
*/

package goNum

func Anm(n, m int) int {
	//不直接使用阶乘计算可以稍许增加速度
	temp0 := 1
	for i := n; i >= n-m+1; i-- {
		temp0 = temp0 * i
	}
	return temp0
}
