// Anm
/*
------------------------------------------------------
作者   : Black Ghost
日期   : 2018-12-6
版本   : 0.0.0
------------------------------------------------------
             m
    计算排列 A  的值
             n
------------------------------------------------------
输入   :
    n       整数
    m       整数, m <= n
输出   :

------------------------------------------------------
*/

package goNum

// Anm
//              m
//    计算排列 A  的值
//              n
func Anm(n, m int) int {
	/*
	                m
	       计算排列 A  的值
	                n
	   ------------------------------------------------------
	   输入   :
	       n       整数
	       m       整数, m <= n
	   输出   :
	*/
	//不直接使用阶乘计算可以稍许增加速度
	temp0 := 1
	for i := n; i >= n-m+1; i-- {
		temp0 = temp0 * i
	}
	return temp0
}
