// Cnm
/*
------------------------------------------------------
作者   : Black Ghost
日期   : 2018-12-6
版本   : 0.0.0
------------------------------------------------------
             m
    计算组合 C  的值
             n
------------------------------------------------------
输入   :
    n       数据点矩阵，(n+1)x2，第一列xi；第二列yi
    m       插值点, xq!=xi
输出   :
    sol     结果
    err     解出标志：false-未解出或达到步数上限；
                     true-全部解出
------------------------------------------------------
*/

package goNum

func Cnm(n, m int) int {
	//不直接使用阶乘计算可以稍许增加速度
	return Anm(n, m) / Factorial(m)
}
