// Cnm
/*
------------------------------------------------------
作者   : Black Ghost
日期   : 2018-12-6
版本   : 0.0.0
------------------------------------------------------
             m
    计算组合 C  的值
             n
------------------------------------------------------
输入   :
    n       整数
    m       整数，m <= n
输出   :

------------------------------------------------------
*/

package goNum

// Cnm
//             m
//    计算组合 C  的值
//             n
func Cnm(n, m int) int {
	/*
	                m
	       计算组合 C  的值
	                n
	   输入   :
	       n       整数
	       m       整数，m <= n
	   输出   :
	*/
	//不直接使用阶乘计算可以稍许增加速度
	return Anm(n, m) / Factorial(m)
}
